$(function(){
	/*彈窗使用 start*/
	$( "#html-content" ).click(function() {
		  $.sweetModal({
			title: '夫妻會員規章',
			content: '<p>會員向本公司申請收款功能時，應依本公司相關程序進行驗證並提供相關資料文件，經本公司驗證通過後，會員即取得特約商店資格得依本公司提供之各項收款方式進行交易收款。</p><h1 class="ruleH1">＞歡迎您加入成為那對夫妻粉絲會員</h1><p>01：那對夫妻網站係由超人氣娛樂股份有限公司所創設，根據那對夫妻服務網站使用條款所提供的服務，本條款訂定的主要目的，在於維護會員的一切權益，同時確認那對夫妻網站、商品供應者、會員之間的契約關係，當您在、那對夫妻網站登載會員資料並發出後，您會在您所提供的電子郵件信箱中，收到那對夫妻網站所發出的【會員資料確認函】，並確認加入會員之後，表示您已經閱讀、瞭解且同意接受本條款所有的內容與約定，並完全認同那對夫妻網站現有與將來可能衍生的其他服務，那對夫妻網站有權在任何時間，基於會員權益與本站需要，進行修改或變更本條款內容，修改後將立即公佈在那對夫妻網站的【會員中心】當中，但不會一一個別通知會員，我們建議您隨時查詢以了解相關的修改與變更。您在那對夫妻網站做了必要的任何修改或變更之後，仍繼續使用本網站的服務，都將視為您已經詳加閱讀、理解，並且完全同意我們相關的修改與變更。如果您不同意本條款的內容，建議您應立即停止使用本站的服務。<br /> 02：申請加入那對夫妻網站會員為免費性質。在您成為那對夫妻網站站會員之後，即可使用那對夫妻網站網站所提供之各種服務，並需遵守會員規章及各項交易規定，如未遵守，那對夫妻網站站保留取消會員資格之權利，一旦被取消會員資格，將喪失所有會員權利及福利，會員不得要求任何形式之補償或賠償。<br />03：您承諾遵守中華民國相關法規及國際網際網路規定與慣例。<span class="colorR"></span></p><h1 class="ruleH1">＞會員的服務範圍</h1><p>01：那對夫妻網站所提供的服務範圍，包括wen-li.eution.com網域下所有網頁，以及將來所有可能的衍生網頁都屬於那對夫妻網站，包括使用所提供的金流、物流、資訊流平台之所有網站、實體等一切服務。其服務內容包括但不限於商品交易、內容瀏覽、各類會員電子報、點數兌換服務或任何其他將來新增之會員服務功能、與利用電子郵件或其他合法方式，進行商品行銷與資訊提供。BUY BEAUTY得依實際情形，增加、修改或是終止相關服務。</p><h1 class="ruleH1">＞那對夫妻網站的會員帳號、密碼與安全</h1><p>01：那對夫妻網站會員帳號即身分證字號，須詳實填寫，身份證字號及密碼，不能重複登錄。除非經他人合法授權使用其個人資料以外，如果您提供任何不實、錯誤的資料進行登載，那對夫妻網站有權暫停或是終止您的帳號，並拒絕您成為會員。<br /> 02：如果您選擇以信用卡方式購物時，必須請您填寫信用卡的確實資料；若有不實的登載或未經持卡人許可，而發生盜刷其信用卡的情況時，那對夫妻網站得以暫停或終止您的會員資格，若您違反了台灣相關法律，也將會受到現行法律的追究。<br /> 03：那對夫妻網站不會留存會員在網站上登錄之信用卡號等相關資料，以保護會員之隱私及權益。<br />04：那對夫妻網站有權依本網站的需要，關閉長時間未使用的會員帳號，並以電子郵件通知您。<br /> 05：為維護您的權益，請妥善保存您的帳號及密碼，那對夫妻網站網站係依據這組帳號及密碼來認定會員身分，以完成該會員在那對夫妻網站網站上的所有交易，以及累積點數等權益之行使。如果您懷疑密碼可能外洩，請立即至【那對夫妻網站會員中心】更新您的資料。如考量到或有遺失或被竊的顧慮，應即時通知那對夫妻網站站，以保障您的會員權益。<br /> 06：那對夫妻網站站僅接受同一人之單筆資料加入會員，意即您只能建立一次您的個人資料，請勿重覆登錄。</p><h1 class="ruleH1">＞相關責任與限制</h1><p>01：那對夫妻網站會員在使用本站服務過程中的一切資料紀錄，以那對夫妻網站資料庫所記錄的資料為基準。如發生任何糾紛，雙方須以最大誠意，各自提出所儲存之電子資料記錄，詳實提交於法院或公正第三人作認定。</p><h1 class="ruleH1">＞圓利網站服務暫停與中止</h1><p>01：那對夫妻網站以目前社會、法律認為合理的方式及技術，維護本網站應有的正常運作；但在下列必要之情形下，那對夫妻網站將有權暫停、中斷或拒絕提供本站服務的全部或某部分，且對使用者任何直接或間接的損害，均不負擔任何賠償、補償等責任。<ol><li>1.那對夫妻網站相關軟硬體設備進行搬遷、更換、升級、保養或維修時。</li><li>2.使用者有任何違反政府法令或本條款情形。</li><li>3.天災或其他不可抗力之因素所導致之服務停止或中斷。</li><li>4.其他不可歸責於那對夫妻網站之事由所致的服務停止或中斷。</li><li>5.非本公司所能控制之事由，而致本服務資訊顯示不正確、或遭偽造、竄改、刪除或擷取、或致系統中斷或不能正常運作時。</li><li>6.使用本公司簡訊發送或其他電子訊息傳輸服務時，出現誹謗、攻擊或傷害性文字，或其他違背社會善良風俗之內容，那對夫妻網站有權拒絕您使用本服務。</li></ol></p><p>02：那對夫妻網站針對可預知之軟硬體維護工作，有可能導致系統中斷或是暫停者，將會於該狀況發生前，以適當之方式告知會員。</p><h1 class="ruleH1">＞圓利網站會員終止與本公司通知之義務</h1><p>01：如果您產生前述提供錯誤或不實資料進行會員登錄、未經本人許可而盜刷其信用卡、無故退換商品超過一定比率時，或其他經查證屬實之不法或違反本會員條款情事，那對夫妻網站得終止您的會員帳號，以維護其他會員合法使用本網站的相關權利。那對夫妻網站的任何聲明、條款，如有未盡完善之處，將以最大誠意，依誠實信用、平等互惠原則，共商解決之道。<br /> 02：在您決定取消那對夫妻網站會員資格，並以電子郵件或透過那對夫妻網站所提供之線上服務等方式，通知那對夫妻網站取消您的會員資格後，將自停止那對夫妻網站會員身份之日起（以您透過電子郵件發出取消那對夫妻網站會員資格的日期為準），即代表喪失所有那對夫妻網站所提供之所有會員權益，並且遭到那對夫妻網站註銷會員資格。（註銷會員資格並不會另外通知您）</p><h1 class="ruleH1">＞那對夫妻網站站所制定條款的效力、依據法律與管轄法院</h1><p>01：在那對夫妻網站會員條款當中，任何條款的全部或某部份無效時，並不影響其他約定的效力。<br /> 02：您與那對夫妻網站之權利義務關係，應依台灣法律及網路交易指導原則所規範；若發生任何爭議、糾紛， 應以台灣台北地方法院為第一審管轄法院。</p>'
			});
	});
	$( "#html-privacy" ).click(function() {
	  $.sweetModal({
		title: '客戶隱私權政策',
		content: '<p>會員向本公司申請收款功能時，應依本公司相關程序進行驗證並提供相關資料文件，經本公司驗證通過後，會員即取得特約商店資格得依本公司提供之各項收款方式進行交易收款。</p><h1 class="ruleH1">第一條 會員同意事項</h1><p>會員使用本公司提供之服務項目進行收款（以下簡稱本收款服務）時，應當遵守法令及會員與本公司約定之各項服務規範。<span class="colorR">會員與交易相對人發生交易糾紛時，本公司應秉持服務精神協助交易雙方排解交易糾紛。若交易相對人使用信用卡支付後並透過發卡機構主張拒絕付款或其他產生爭議款項之情事者，本公司應依主管機關就「信用卡消費爭議帳款處理機制」規範之相關法令，協助交易雙方處理爭議款項，但本公司不負支付該筆帳款給予會員之義務；若本公司已為給付者，會員應返還本公司所墊付之款項，並同意本公司得自應付會員之他次請款金額或應付款項中逕予抵扣；倘致本公司受有損害，會員應負損害賠償責任，本公司並得依法追訴會員之相關法律責任。若會員未遵從本特約商店服務規範或本公司網站服務說明、交易頁面中之操作提示、規則等，本公司得拒絕為會員提供本收款服務之一部或全部，會員並應承擔因此所生之責任。如可歸責於會員因素導致本公司之錯誤而將交易款項先行撥付至會員之綠界帳戶或金融機構帳戶者，會員應於本公司通知之期限內返還該筆交易款項予本公司；會員並同意本公司得自會員之綠界帳戶之帳戶餘額或他次代收款項中逕予抵扣該筆交易款項及（或）暫停會員要求自會員之綠界帳戶提領該筆交易款項至會員金融機構帳戶之權利。會員並應承擔相關費用。如發現使用信用卡進行無實質交易之收款，會員同意本公司得將其信用卡支付之款項進行退刷，如該款項已撥付至會員之綠界帳戶或金融機構帳戶者，會員應於本公司通知之期限內返還該筆交易款項予本公司。</span></p><p>本公司為編印或建置商家目錄目的需要，得使用會員在本公司登記之資料，但會員要求不刊登者，不在此限。會員對於本公司就本收款服務所核發之專用帳號及密碼，包括但不限於測試帳號密碼等，應善盡保管、保密之責。</p><p>本公司得向會員查詢交易之物品或提供之服務項目內容，會員負有詳盡描述交易商品、服務之揭露義務並註明其他有關事項（如附加費用等），並應確保交易資料之正確性。會員就所銷售之遞延性商品或服務，依相關法規規定辦理履約保證（含信託），並應揭露該履約保證資訊予交易相對人知悉。會員如有發行電子儲值型禮卷者，應提供適當的餘額揭露方式，供交易相對人查詢知悉禮卷餘額。<br />會員應依據稅法相關規定辦理統一發票開立及報稅事宜會員同意配合本公司、本收款服務合作之金融機構、信用卡組織或主管機關(如金融監督管理委員會等)定期或不定期進行查核作業（查核內容包括但不限於交易紀錄或交易異常狀況）並辦理相關事宜，且會員同意本公司或其他有權機關得向會員進行必要之資料安全查核，以確保交易資料之安全性。若會員遇有交易障礙得立即與本公司客服單位聯繫處理，不得隨意與未經本公司確認身份之人員接觸，以避免個人資料或交易相關資料洩漏而造成第三人之損失，若可歸責於會員因素導致上述情事發生所生之損害，會員應負賠償之責。會員應於營業網站或實體店舖明顯處揭露交易支付服務係由「綠界科技股份有限公司」提供，具體之揭露方式應依本公司提供之方法為之。<br />本公司得要求會員進行必要的教育訓練及配合法令宣導事項。</p><h1 class="ruleH1">第二條 網際網路交易</h1><p>透過網際網路連線方式進行之電子交易，會員應自行負責就其交易對象為必要之查核。會員應將交易商品或服務之相關資訊(如下範例資訊)於交易前揭露予交易相對人，並應保留所有訂單記錄、出貨單據及客戶簽收單。若有交易糾紛產生，本公司將協助交易雙方協商解決。</p><p>商品價格：交易金額（內含營業稅）。<br />付款方式：提供之付款金流方式。<br />商品內容：提供之商品或服務內容。<br />聯絡方式：客戶服務窗口（聯絡電話及Email address）。<br />寄送方式：商品寄送之方式及時間（快遞、郵寄、郵寄費用及應由何人負擔或其他....等）。<br />退貨條件：退貨方式及條件。<br />猶豫期：「商品猶豫期間」之訊息及期間。<br />其它條件：商品是否有進出口限制或額外稅賦（依他國法令而有不同者須做特別說明）。<br />商品銷售依法令應揭露之事項（政府核發之許可字、證號等）</p><h1 class="ruleH1">第三條 信用卡款項代理收付服務特別約定</h1><p>若會員申請使用本收款服務提供之信用卡款項代理收付服務，會員應同意遵守以下事項：</p><p>會員須注意與其交易之交易相對人是否有異常刷卡情形，若發現任何有疑義之簽帳交易或與其交易之交易相對人所使用之信用卡包括但不限於可能係偽造、掛失卡、或持卡人交易行為值得懷疑者，會員應通知本公司協助向合作之金融機構進行確認，並配合為必要之處理。<br />非經本公司事前書面同意，會員不得另外再裝置任何擷取或留存卡號資料之軟硬體程式，如有違反本公司得暫停或終止會員使用信用卡款項代理收付服務，倘造成損害，會員應負損害賠償之責。<br />會員於實體通路交易時，提供予交易相對人之簽帳單至少應載明收單機構名稱、本公司名稱、會員名稱、卡別、卡號、授權號碼、交易日期及金額，且卡號之揭露方式應依主管機關之規定辦理，並妥善保管資料及簽帳單。交易雙方採用信用卡支付交易款項時，整筆交易須一次取得授權及請款，會員不得將一筆交易攤分作兩筆或多筆金額（即化整為零）進行分刷交易並重新個別取得交易授權號碼或有其他變相之融資行為。<br />會員若經司法及相關機關、國際信用卡組織、發卡機構或其他收單機構等單位通報、或經本公司認定會員為從事風險交易者，本公司無須事先通知會員，得暫時停止會員之信用卡款項代理收付服務。本公司應於收到前述機關單位通知會員無風險之虞後才得回復相關信用卡款項代理收付服務，會員同意不得請求暫停信用卡款項代理收付服務期間相關交易款項之利息或其他賠償。<br />會員使用信用卡款項代理收付服務與交易相對人進行網路交易，交易相對人得免於簽單簽名及刷卡，會員須保留可隨時提供本公司有關網路交易之證明；如本公司通知會員相關信用卡支付款項失敗時，會員即不得交貨或繼續提供服務或勞務。會員不得讓財務資融公司等不提供商品或服務之機構透過信用卡款項代理收付服務進行交易。</p><p class="colorR">會員有下列情形之一者，本公司對信用卡款項代理收付交易無付款之義務，若本公司已為給付者，會員負返還之責。本公司並得自應支付予會員之他次請款金額或應付款項或自會員綠界帳戶中餘額逕行扣除抵充之。致生之損害及衍生之一切相關費用，會員應負賠償之責。<br />會員未依本特約商店服務規範第三條內容處理帳款。<br />非屬本公司核給之專屬商店代號進行信用卡款項代理收付交易。<br />未透過本公司信用卡款項代理收付服務所取得交易授權號碼（含偽造及自編交易授權號碼）。<br />無實際購買商品或服務之交易行為，包括但不限於向地下錢莊使用信用卡預借現金。<br />會員替其他會員或第三方刷卡或非透過本公司提供之信用卡款項代理收付服務向本公司結帳請款者。<br />會員受理非經合法登記之營業項目、或交易雙方從事非法交易而產生之簽帳交易，包括但不限於現金出借交易者；但經會員提出該簽帳交易並非從事非經合法登記之營業項目而產生之證明者，本公司及合作金融機構於確認該筆款項已無遭司法機關留置或遭其他發卡機構拒付時，本公司應將款項返還予會員。<br />本公司接獲發卡機構或國內、外任一清算機構拒付者。<br />未經過安全控管機制的交易(例如：網路交易使用信用卡國際組織安全認證3D-Secure)，經持卡人透過發卡機構否認交易，且本公司已提供持卡人否認交易之相關文件予會員。<br />經本公司或司法、相關機關、國際信用卡組織、發卡機構或其他收單機構等單位舉證會員不符合信用卡國際組織所制訂之信用卡簽帳交易規定及習慣者。自合約終止生效日起，未於十個營業日內向本公司請款之剩餘簽帳交易款項。</p><p>本信用卡款項代理收付服務因系統設備障礙、斷線，以致無法透過網路取得交易授權碼時，依信用卡國際組織規範，會員不得利用電話及人工索取授權碼，會員得聯繫本公司客服中心尋求協助。<br />本公司對會員應透過信用卡款項代理收付服務向公司請求撥付信用卡代收交易款項，不得另向其他機構請款。<br />會員應對使用信用卡付款之交易相對人，提供同等質之服務及優待，會員非有正當理由不得向交易相對人加收手續費或限制交易相對人之交易付款方式，且不得限制每筆交易最高及最低金額。<br />會員不得將本公司依信用卡款項代理收付服務向會員所收取之手續費或其他相關費用轉嫁於交易相對人之交易金額內，亦不得以其他任何理由附加價款予交易相對人，若有上述轉嫁或附加價款之行為時，會員須立即將轉嫁或附加款退還交易相對人，若有任何對交易相對人之不公平待遇，經查證屬實者，會員須負全責處理，如因此造成本公司損失，會員應負賠償責任。<br />會員如自行提供以信用卡分期付款服務者，不得將應收債權讓售予第三人。<br />會員不得將本公司提供之信用卡款項代理收付服務商店代號、簽帳用品和相關軟硬體設備（含刷卡機），借予、讓與或供他人使用；亦不得向他人借入商店代號和相關軟硬體設備（含刷卡機）。<br />會員不得將本公司提供之簽帳用品和相關軟硬體設備（含刷卡機）進行破壞、偷竊交易資料或擅自修改相關程式。</p><h1 class="ruleH1">第四條 保密義務及所有權</h1><p>會員因本收款服務而知悉交易相對人之任何交易相關資料時，除其他法律或主管機關另有規定者外應，須保守秘密。<br />會員所使用本收款服務中所有相關業務資料服務及軟、硬體設備，其專利權、商標、營業秘密、其他智慧財產權、所有權或其他權利，均以本公司為權利人，除依法令規定或主管機關之要求者外，應保守秘密；未經本公司同意，會員不得擅自重製、傳輸、改作、編輯、登載或以其他任何目的加以使用，若對本公司或第三方因此所受包括但不限於財產、名譽或商譽等一切損失須負損害賠償責任。<br />本項保密義務於<a href="https://www.ecpay.com.tw/About/ProvisionOnMember_20131226_2" target="_blank">《綠界平台會員服務條款》</a>終止或有效期間屆滿後仍繼續有效。</p><h1 class="ruleH1">第五條 規範內容修訂及業務訊息之傳達</h1><p>因本特約商店服務規範之內容修訂，本公司應依<a href="https://www.ecpay.com.tw/About/ProvisionOnMember_20131226_2" target="_blank">《綠界平台會員服務條款》</a>約定通知方式進行送達。</p>'
		});
	});
	$( "#actionNotice" ).click(function() {
	  $.sweetModal({
		title: '注意事項與寄送辦法',
		content: '<p><h1>注意事項</h1><ul><li>1. 此活動由超人氣娛樂舉辦，有任何疑問請來信客服信箱 :<a herf="mailto:sever@supermedia.cool">sever@supermedia.cool</a></li><li>2. 粉絲於參加活動同時，請詳細參閱活動辦法說明以及注意事項之規範。</li><li>3. 所有獎品不可要求兌換成現金或其他物品，主辦單位保留更換獎品或修改辦法之權利。</li><li>4. 得獎者請依照「得獎通知」回覆相關資料，若逾期回覆或資料填寫不全，而導致無法聯繫、逾期未領獎、郵遞失敗，則視為棄權。</li><li>5. 活動期間如遇不可抗拒之因素，超人氣保有最終修改權利，並可依實際情況予以增刪、修訂或變更活動辦法。</li></ul></h1></p><p><h1>開獎/寄送辦法</h1><ul><li>1.本活動預計於 2017-03-01開獎</li><li>2.活動開獎時或寄送獎品前，若參加者的個人臉書帳號呈現為異常狀態，主辦單位有權取消其得獎資格，請參加者留意確認帳號為正常使用狀態。</li><li>3.每人僅有乙次獲獎機會，若疑似同一人重覆得獎，主辦單位得要求以指定方式確認身份，若參加者無法配合，主辦單位有權取消其得獎資格。</li><li>4.開獎名單將會公告在活動頁面，並通知獲獎者提供寄送地址，若於2017/3/5前尚未回覆寄送地址，視同棄權。</li></ul></h1></p>'
		});
	});

	$( ".changeBtn" ).click(function() {

	});
	/*彈窗使用 End*/

	/*清除欄位值 start*/
	$( ".clearBtn" ).click(function() {
		$( ".sky-form" ).find( "input" ).attr("value", "");
	});
	/*清除欄位值 End*/

	/*確認欄位是否未填 start*/
	$('.changeBtn').click(function(){
        var passwdO=$(".passwordOld").val(), passwdN=$(".passwordNew").val(), passwdC=$(".passwordCon").val();
        if( passwdC=='' || passwdN=='' || passwdO=='' ){
            alert("提醒: \r\n 資料輸入不全!");
            return false;
        }else{
        	$.sweetModal({
			content: '修改成功',
			icon: $.sweetModal.ICON_SUCCESS
		});
        	var speed = 2000;
			setTimeout("history.back()", speed);
			function goto() {
			    location = "member.html";
			}
        }
	});
	/*確認欄位是否未填 End*/
	/*goTop start*/
	$(function () {
		$(".scroll").click(function () {
			jQuery("html,body").animate({
				scrollTop: 0
			}, 1000);
		});
		$(window).scroll(function () {
			if ($(this).scrollTop() > 300) {
				$('.scroll,#goTop').fadeIn("fast");
			} else {
				$('.scroll,#goTop').stop().fadeOut("fast");
			}
		});
	});
	/*goTop End*/
	/*活動頁 下拉選單start*/
	$( ".loginBox" ).click(function() {
	   $( ".logoinMenu" ).slideToggle( "fast", function() {
	     // Animation complete.
	   });
	 });
	/*活動頁 下拉選單 End*/

	/*loading icon start*/
	$(".defineBtn").click(function () {
		$('#loading').fadeIn("fast");
	});
	/*loading icon End*/
	/*header menu 切換css start*/
	$(".tabs .tab").click(function () {
		$(this).addClass('active').siblings('.active').removeClass('active');
	});
	/*header menu 切換css End*/

	/*愛心onclick 換圖 start*/
	 $(".videoDetBox1Img02").click(function () {
		$(this).addClass('active').siblings('.active').removeClass('active');
		event.preventDefault();
	});
	/*愛心onclick 換圖 End*/
	/*留言區回覆 start*/
	$(".reply2").click(function () {
		//$(this).parents(".messageBox1").children(".reply1").css("display","block");
		event.preventDefault();
		if ( $(this).parents(".messageBox1").children(".reply1").hasClass( "active" )) {
			$(this).parents(".messageBox1").children(".reply1").css("display","none").removeClass("active");
		}else{
			$(this).parents(".messageBox1").children(".reply1").css("display","block").addClass("active");
		}
	});
	$(".comment_like").click(function () {
		$(this).attr("src","/static/img/like_1.png");
		event.preventDefault();
	});
	$(".re_comment_like").click(function () {
		$(this).attr("src","/static/img/like_1.png");
		event.preventDefault();
	});
	/*留言區回覆 End*/

	/*影片內頁分享 start*/
	$("#messenger").click(function () {
		$("#fbMessenger").fadeIn(500);
	});
	$("#fbMessenger").click(function () {
		if ($("#fbMessenger").not("iframe")) {
			$('#fbMessenger').fadeOut(500);
		}
	});
	 $(document).ready(function(){
	 	$(window).scroll(function(){
		    console.log( )
	      });
	   });
	/*影片內頁分享 End*/

	/*影片內頁往上下滑動 顯示隱藏 header footer start
	 var previousScroll = 0;
	 var thescrollVal = 0;
     $(document).ready(function(){
	   $(window).scroll(function(){
	     //var scrollPosCur = this.scrollY;]
	     var currentScroll = this.scrollY;
	     var window_height = $( window ).height();
	     var window_scrollTop = $(window).scrollTop();
	     var document_height = $( document ).height();
	     if(currentScroll <= 0){

	     }
	     else{
	     	if (currentScroll > previousScroll){
			//down
			$(".header").addClass("slideOutUp").removeClass("slideInDown");
			$("#headerMenu").addClass("slideOutUp").removeClass("slideInDown").parent().addClass("videoTop");
			//console.log("down");
	       } else {
	       	//up
	       	$(".header").removeClass("slideOutUp").addClass("slideInDown");
	       	$("#headerMenu").removeClass("slideOutUp").addClass("slideInDown").parent().removeClass("videoTop");
	       	//console.log("up");
	       }
	       if(window_height + window_scrollTop == document_height){
	       	//到底部
	       }
	     }


	     //scrollPos = scrollPosCur;
	     previousScroll = currentScroll;
	   });

	 });
	影片內頁往上下滑動 顯示隱藏 header footer End*/
	// Hide Header on on scroll down
	/*影片來源切換 start*/
	 $(".videoDetBox1Img05").click(function () {
		$("#youtubeImg").attr("src","/static/img/youtube_h.png");
		$("#youkuImg").attr("src","/static/img/youku.png");
		event.preventDefault();
	});
	$(".videoDetBox1Img06").click(function () {
		$("#youtubeImg").attr("src","/static/img/youtube.png");
		$("#youkuImg").attr("src","/static/img/youku_h.png");
		event.preventDefault();
	});
	/*影片來源切換 End*/
/*影片內頁往上下滑動 顯示隱藏 header footer start
	 var previousScroll = 0;
	 var thescrollVal = 0;
     $(document).ready(function(){
	   $(window).scroll(function(){
	     //var scrollPosCur = this.scrollY;]
	     var currentScroll = this.scrollY;
	     var window_height = $( window ).height();
	     var window_scrollTop = $(window).scrollTop();
	     var document_height = $( document ).height();
	     if(currentScroll <= 0){

	     }
	     else{
	     	if (currentScroll > previousScroll){
			//down
			$(".video-container").addClass("active");
			$(".videoDetBox1").addClass("active");
			//console.log("down");
	       } else {
	       	//up
	       	$(".video-container").removeClass("active");
			$(".videoDetBox1").removeClass("active");
	       	//console.log("up");
	       }
	       if(document_height==(window_height+window_scrollTop)){
	       	//到底部
	       	$(".video-container").show();
			$(".videoDetBox1").show();
	       }
	     }


	     //scrollPos = scrollPosCur;
	     previousScroll = currentScroll;
	   });

	 });
	影片內頁往上下滑動 顯示隱藏 header footer End*/

});